ErpTest/src/Reports/уатСравнениеЗаправокПоПластиковымКартам/уатСравнениеЗаправокПоПластиковымКартам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>уатСравнениеЗаправокПоПластиковымКартам</name>
  <comment>(уат)</comment>
</mdclass:Report>

ErpTest/src/AccumulationRegisters/уатОборотыПоОтчетамПоставщиковПЦ/уатОборотыПоОтчетамПоставщиковПЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатОборотыПоОтчетамПоставщиковПЦ</name>
  <comment>(уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьУпр</name>
    <comment>Стоимость в валюте управленческого учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПластиковаяКарта</name>
    <type>
      <types>CatalogRef.уатТопливныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ТСотчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АЗС</name>
    <comment>АЗС</comment>
    <type>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураОтчета</name>
    <comment>Номенклатура отчета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПластиковаяКартаОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/уатВидыДвиженияГСМ/уатВидыДвиженияГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыДвиженияГСМ</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>ЗаправкаНаличные</name>
  </enumValues>
  <enumValues>
    <name>ЗаправкаПластиковаяКарта</name>
  </enumValues>
  <enumValues>
    <name>ЗаправкаПластиковаяКартаСклад</name>
  </enumValues>
  <enumValues>
    <name>ЗаправкаПоставщик</name>
  </enumValues>
  <enumValues>
    <name>ЗаправкаСклад</name>
  </enumValues>
  <enumValues>
    <name>ЗаправкаТалоны</name>
  </enumValues>
  <enumValues>
    <name>Слив</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПЛ</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/уатЗаправкаГСМ/уатЗаправкаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатЗаправкаГСМ</name>
  <comment>(уат)</comment>
  <basedOn>Document.уатПутевойЛист</basedOn>
  <registerRecords>AccumulationRegister.уатОстаткиГСМнаТС</registerRecords>
  <registerRecords>AccumulationRegister.уатОстаткиТЖнаТС</registerRecords>
  <registerRecords>AccumulationRegister.уатОборотыПоЗаправкамГСМ</registerRecords>
  <registerRecords>AccumulationRegister.уатРасходТехническихЖидкостей</registerRecords>
  <attributes>
    <name>АЗС</name>
    <type>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДвиженияГСМ</name>
    <type>
      <types>EnumRef.уатВидыДвиженияГСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <comment>Количество документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заправки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <comment>Транспортное средство или оборудование</comment>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ГСМ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПластиковаяКарта</name>
      <type>
        <types>CatalogRef.уатТопливныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутевойЛист</name>
      <type>
        <types>DocumentRef.уатПутевойЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Плотность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераТалонов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <type>
        <types>CatalogRef.ВидыЦенПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>пкЧек</name>
      <comment>№ чека по заправке ГСМ</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Reports/уатСравнениеЗаправокПоПластиковымКартам/Forms/Форма/Module.bsl
&НаСервере
Перем Цвет1;
Перем Цвет2;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция СтрокаСортировки()
	Если Сортировка = "По карте" Тогда
		Рез = "ПластиковаяКартаПредставление, ДатаОбщ, ТСПредставление";
	ИначеЕсли Сортировка = "По дате заправки" Тогда
		Рез = "ДатаОбщ, ПластиковаяКартаПредставление, ТСПредставление";
	Иначе
		Рез = "ТСПредставление, ДатаОбщ, ПластиковаяКартаПредставление";
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция МодульЧисла(ТекЧисло)
	Возврат ?(ТекЧисло > 0, ТекЧисло, -ТекЧисло);
КонецФункции

// Основная процедура формирования отчета.
//Формирует отчет в виде табличного документа.
//
//Параметры:
//	ТабДок - табличный документ, куда будет выведен отчет,
//	АЗС, Организация - Отборы по АЗС и Организации,
//	ДатаКон, ДатаНач - период формирования отчета.
//
&НаСервере
Процедура СформироватьОтчетСервер()
	Макет = Отчеты.уатСравнениеЗаправокПоПластиковымКартам.ПолучитьМакет("Отчет");
	
	ЗапросПЦ = Новый Запрос;
	ЗапросПЦ.Текст = 
	"ВЫБРАТЬ
	|	уатОборотыПоОтчетамПоставщиковПЦ.ТС,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Номенклатура КАК ГСМ,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Количество,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Стоимость,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Валюта,
	|	НАЧАЛОПЕРИОДА(уатОборотыПоОтчетамПоставщиковПЦ.Период, ДЕНЬ) КАК Дата,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Период КАК ДатаВремя,
	|	уатОборотыПоОтчетамПоставщиковПЦ.ПластиковаяКарта,
	|	уатОборотыПоОтчетамПоставщиковПЦ.ПластиковаяКартаОтчета,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Регистратор.Номер КАК Номер,
	|	уатОборотыПоОтчетамПоставщиковПЦ.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.уатОборотыПоОтчетамПоставщиковПЦ КАК уатОборотыПоОтчетамПоставщиковПЦ
	|ГДЕ
	|	уатОборотыПоОтчетамПоставщиковПЦ.Организация = &Организация
	|" + ?(НЕ ЗначениеЗаполнено(АЗС), "", "	И уатОборотыПоОтчетамПоставщиковПЦ.АЗС = &АЗС") + "
	|	И уатОборотыПоОтчетамПоставщиковПЦ.Период МЕЖДУ &ДатаНач И &ДатаКон
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Количество,
	|	Стоимость";

	ЗапросПЦ.УстановитьПараметр("ДатаКон", ?(ДатаКон = '00010101', '39991231', КонецДня(ДатаКон)));
	ЗапросПЦ.УстановитьПараметр("ДатаНач", ДатаНач);
	ЗапросПЦ.УстановитьПараметр("АЗС", АЗС);
	ЗапросПЦ.УстановитьПараметр("Организация", Организация);
	
	ТаблицаПЦ = ЗапросПЦ.Выполнить().Выгрузить();
	
	//заполняем представление пластик. карт
	ТаблицаПЦ.Колонки.Добавить("ПластиковаяКартаПредставление");
	Для Каждого ТекСтрока Из ТаблицаПЦ Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ПластиковаяКарта) Тогда
			ТекСтрока.ПластиковаяКартаПредставление = СокрЛП(ТекСтрока.ПластиковаяКарта);
		Иначе
			ТекСтрока.ПластиковаяКартаПредставление = СокрЛП(ТекСтрока.ПластиковаяКартаОтчета);
		КонецЕсли;
	КонецЦикла;

	// запрос по ручным заправкам	
	ЗапросГСМ = Новый Запрос;
	ЗапросГСМ.Текст = 
	"ВЫБРАТЬ
	|	уатЗаправкаГСМЗаправки.Ссылка.Организация КАК Организация,
	|	уатЗаправкаГСМЗаправки.Ссылка.АЗС,
	|	уатЗаправкаГСМЗаправки.ТС,
	|	уатЗаправкаГСМЗаправки.ГСМ,
	|	уатЗаправкаГСМЗаправки.ПластиковаяКарта,
	|	уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ,
	|	уатЗаправкаГСМЗаправки.Количество КАК Количество,
	|	уатЗаправкаГСМЗаправки.Сумма КАК Стоимость,
	|	НАЧАЛОПЕРИОДА(уатЗаправкаГСМЗаправки.Дата, ДЕНЬ) КАК Дата,
	|	уатЗаправкаГСМЗаправки.Дата КАК ДатаВремя,
	|	уатЗаправкаГСМЗаправки.Ссылка.Номер КАК Номер,
	|	уатЗаправкаГСМЗаправки.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.уатЗаправкаГСМ.Заправки КАК уатЗаправкаГСМЗаправки
	|ГДЕ
	|	(уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКарта)
	|	ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад))
	|	И уатЗаправкаГСМЗаправки.Ссылка.Проведен
	|	И уатЗаправкаГСМЗаправки.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И уатЗаправкаГСМЗаправки.Ссылка.Организация = &Организация
	|" + ?(НЕ ЗначениеЗаполнено(АЗС), "", "	И уатЗаправкаГСМЗаправки.Ссылка.АЗС = &АЗС") + "
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Количество,
	|	Стоимость";

	ЗапросГСМ.УстановитьПараметр("ДатаКон", ?(ДатаКон = '00010101', '39991231', КонецДня(ДатаКон)));
	ЗапросГСМ.УстановитьПараметр("ДатаНач", ДатаНач);
	ЗапросГСМ.УстановитьПараметр("АЗС", АЗС);
	ЗапросГСМ.УстановитьПараметр("Организация", Организация);
	
	ТаблицаГСМ = ЗапросГСМ.Выполнить().Выгрузить();
	
	//заполняем представление пластик. карт
	ТаблицаГСМ.Колонки.Добавить("ПластиковаяКартаПредставление");
	Для Каждого ТекСтрока Из ТаблицаГСМ Цикл
		ТекСтрока.ПластиковаяКартаПредставление = СокрЛП(ТекСтрока.ПластиковаяКарта);
	КонецЦикла;
	
	ТаблицаРезультат = Новый ТаблицаЗначений; //ТаблицаПЦ.Скопировать();
	ТаблицаРезультат.Колонки.Добавить("ТС");
	ТаблицаРезультат.Колонки.Добавить("ТСПредставление");
	ТаблицаРезультат.Колонки.Добавить("ПластиковаяКарта");
	ТаблицаРезультат.Колонки.Добавить("ПластиковаяКартаПредставление");
	                                                           
	ТаблицаРезультат.Колонки.Добавить("Дата1");
	ТаблицаРезультат.Колонки.Добавить("ДатаВремя1");
	ТаблицаРезультат.Колонки.Добавить("Номер1");
	ТаблицаРезультат.Колонки.Добавить("ГСМ1");
	ТаблицаРезультат.Колонки.Добавить("Количество1", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 
		уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, 
		ПланыВидовХарактеристик.уатПраваИНастройки.ТочностьОстатковТоплива), ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРезультат.Колонки.Добавить("Стоимость1", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, 
		ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРезультат.Колонки.Добавить("Регистратор1");

	ТаблицаРезультат.Колонки.Добавить("Дата2");
	ТаблицаРезультат.Колонки.Добавить("ДатаВремя2");
	ТаблицаРезультат.Колонки.Добавить("Номер2");
	ТаблицаРезультат.Колонки.Добавить("ГСМ2");
	ТаблицаРезультат.Колонки.Добавить("Количество2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 
		уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, 
		ПланыВидовХарактеристик.уатПраваИНастройки.ТочностьОстатковТоплива), ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРезультат.Колонки.Добавить("Стоимость2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, 
		ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРезультат.Колонки.Добавить("Регистратор2");
	
	ТаблицаРезультат.Колонки.Добавить("ПометитьКрасным");

	// первый проход - проверяем таблицу ПЦ
	Для Каждого ТекСтрока Из ТаблицаПЦ Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ПластиковаяКартаПредставление", ТекСтрока.ПластиковаяКартаПредставление);
		Отбор.Вставить("Дата", ТекСтрока.Дата);
		Отбор.Вставить("ГСМ", ТекСтрока.ГСМ);
		Отбор.Вставить("Количество", ТекСтрока.Количество);
		//Отбор.Вставить("Стоимость", ТекСтрока.Стоимость);
		
		НоваяСтрока					= ТаблицаРезультат.Добавить();
		НоваяСтрока.ТС 				= ТекСтрока.ТС;
		НоваяСтрока.ТСПредставление	= уатОбщегоНазначения.уатПредставлениеТС(ТекСтрока.ТС, 
			уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.ТекущийПользователь(),
			"ОсновнаяОрганизация"));
			
		НоваяСтрока.ПластиковаяКарта = ТекСтрока.ПластиковаяКарта;
		НоваяСтрока.ПластиковаяКартаПредставление = ТекСтрока.ПластиковаяКартаПредставление;
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ПластиковаяКарта) Тогда
			НоваяСтрока.ПометитьКрасным  = Истина;
		КонецЕсли;
					
		НоваяСтрока.ГСМ1 			= ТекСтрока.ГСМ;
		НоваяСтрока.Дата1 			= ТекСтрока.Дата;
		НоваяСтрока.ДатаВремя1 = ТекСтрока.ДатаВремя;
		НоваяСтрока.Номер1 			= ТекСтрока.Номер;
		НоваяСтрока.Количество1 	= ТекСтрока.Количество;
		НоваяСтрока.Стоимость1 		= ТекСтрока.Стоимость;
		НоваяСтрока.Регистратор1 	= ТекСтрока.Регистратор;
			
		//ищем совпадающие заправки
		мСтроки = ТаблицаГСМ.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда
			//есть совпадения
			Если мСтроки.Количество() = 1 Тогда
				мСтрока = мСтроки[0];
			Иначе
				//если совпадений по количеству много, то выбираем равную
				//или наиболее близкую по стоимости заправку
				РазницаСтоимости = МодульЧисла(мСтроки[0].Стоимость - ТекСтрока.Стоимость);
				Если РазницаСтоимости = 0 Тогда //если первая строка с нулевой разницей - то берем ее
					мСтрока = мСтроки[0];
				Иначе
					ИндексСтроки = 0;
					ИндексСтрокиПоиска = 0;
					Для Каждого ТекСтрокаТабГСМ Из мСтроки Цикл
						ТекРазницаСтоимости = МодульЧисла(ТекСтрокаТабГСМ.Стоимость - ТекСтрока.Стоимость);
						Если ТекРазницаСтоимости < РазницаСтоимости Тогда
							ИндексСтрокиПоиска = ИндексСтроки;
						КонецЕсли;
						
						ИндексСтроки = ИндексСтроки + 1;
					КонецЦикла;
					мСтрока = мСтроки[ИндексСтрокиПоиска];
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.ГСМ2 			= мСтрока.ГСМ;
			НоваяСтрока.Дата2 			= мСтрока.Дата;
			НоваяСтрока.ДатаВремя2 = мСтрока.ДатаВремя;
			НоваяСтрока.Номер2 			= мСтрока.Номер;
			НоваяСтрока.Количество2 	= мСтрока.Количество;
			НоваяСтрока.Стоимость2 		= мСтрока.Стоимость;
			НоваяСтрока.Регистратор2 	= мСтрока.Регистратор;
			
			ТаблицаГСМ.Удалить(мСтрока);
		КонецЕсли;	
	КонецЦикла;
	
	// второй проход - проверяем таблицу ручных заправок
	Для Каждого ТекСтрока Из ТаблицаГСМ Цикл
		НоваяСтрока					 = ТаблицаРезультат.Добавить();
		НоваяСтрока.ТС 				 = ТекСтрока.ТС;
		НоваяСтрока.ТСПредставление	 = уатОбщегоНазначения.уатПредставлениеТС(ТекСтрока.ТС, 
			уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.ТекущийПользователь(),
			"ОсновнаяОрганизация"));
			
		НоваяСтрока.ПластиковаяКарта = ТекСтрока.ПластиковаяКарта;
		НоваяСтрока.ПластиковаяКартаПредставление = ТекСтрока.ПластиковаяКартаПредставление;
					
		НоваяСтрока.ГСМ2 			 = ТекСтрока.ГСМ;
		НоваяСтрока.Дата2 			 = ТекСтрока.Дата;
		НоваяСтрока.ДатаВремя2 = ТекСтрока.ДатаВремя;
		НоваяСтрока.Номер2 			 = ТекСтрока.Номер;
		НоваяСтрока.Количество2 	 = ТекСтрока.Количество;
		НоваяСтрока.Стоимость2 		 = ТекСтрока.Стоимость;
		НоваяСтрока.Регистратор2 	 = ТекСтрока.Регистратор;
	КонецЦикла;
	
	//добавляем колонку ДатаОбщ для сортировке по дате
	ТаблицаРезультат.Колонки.Добавить("ДатаОбщ");
	Для Каждого ТекСтрока Из ТаблицаРезультат Цикл
		//"общая" дата
		Если ТекСтрока.ДатаВремя1 = Неопределено Тогда
			ТекСтрока.ДатаОбщ = ТекСтрока.ДатаВремя2;
		Иначе
			ТекСтрока.ДатаОбщ = ТекСтрока.ДатаВремя1;
		КонецЕсли;
		//заполняем количество и стоимость, если неопределено
		Если ТекСтрока.Количество1 = Неопределено Тогда
			ТекСтрока.Количество1 = 0;
		КонецЕсли;
		Если ТекСтрока.Количество2 = Неопределено Тогда
			ТекСтрока.Количество2 = 0;
		КонецЕсли;
		Если ТекСтрока.Стоимость1 = Неопределено Тогда
			ТекСтрока.Стоимость1 = 0;
		КонецЕсли;
		Если ТекСтрока.Стоимость2 = Неопределено Тогда
			ТекСтрока.Стоимость2 = 0;
		КонецЕсли;
	КонецЦикла;
	
	//сортируем
	ТаблицаРезультат.Сортировать(СтрокаСортировки());
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал 			= Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы 	= Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	Для Каждого ТекСтрока Из ТаблицаРезультат Цикл
		Если ТекСтрока.Количество1 = ТекСтрока.Количество2 И ТекСтрока.Стоимость1 = ТекСтрока.Стоимость2
			И ОтображатьТолькоРазличные Тогда
			Продолжить;
		КонецЕсли;
		
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ТекСтрока);
		Если ТекСтрока.ПометитьКрасным = Истина Тогда
			ОбластьДетальныхЗаписей.Области.ПластиковаяКарта.ЦветТекста = WebЦвета.Красный;
		Иначе
			ОбластьДетальныхЗаписей.Области.ПластиковаяКарта.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
		КонецЕсли;
		
		Если НЕ НеРаскрашивать Тогда // раскраска
			Если ТекСтрока.Количество1 = 0 И ТекСтрока.Количество2 = 0 Тогда //нулевые не красим вообще
				ОбластьДетальныхЗаписей.Области.Количество1.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
				ОбластьДетальныхЗаписей.Области.Количество2.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
			Иначе
				Если ТекСтрока.Количество1 <> ТекСтрока.Количество2 Тогда //не соответствуют - красные
					Если ТекСтрока.Количество1 = 0 Тогда
						ОбластьДетальныхЗаписей.Области.Количество1.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
					Иначе
						ОбластьДетальныхЗаписей.Области.Количество1.ЦветФона = Цвет2;
					КонецЕсли;
					Если ТекСтрока.Количество2 = 0 Тогда
						ОбластьДетальныхЗаписей.Области.Количество2.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
					Иначе
						ОбластьДетальныхЗаписей.Области.Количество2.ЦветФона = Цвет2;
					КонецЕсли;
				Иначе //соответствуют - зеленые
					//ОбластьДетальныхЗаписей.Области.Количество1.ЦветФона = Цвет1;
					//ОбластьДетальныхЗаписей.Области.Количество2.ЦветФона = Цвет1;
					ОбластьДетальныхЗаписей.Области.Количество1.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
					ОбластьДетальныхЗаписей.Области.Количество2.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекСтрока.Стоимость1 = 0 И ТекСтрока.Стоимость2 = 0 Тогда //нулевые не красим вообще
				ОбластьДетальныхЗаписей.Области.Стоимость1.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
				ОбластьДетальныхЗаписей.Области.Стоимость2.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
			Иначе
				Если ТекСтрока.Стоимость1 <> ТекСтрока.Стоимость2 Тогда //не соответствуют - красные
					Если ТекСтрока.Стоимость1 = 0 Тогда
						ОбластьДетальныхЗаписей.Области.Стоимость1.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
					Иначе
						ОбластьДетальныхЗаписей.Области.Стоимость1.ЦветФона = Цвет2;
					КонецЕсли;
					Если ТекСтрока.Стоимость2 = 0 Тогда
						ОбластьДетальныхЗаписей.Области.Стоимость2.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
					Иначе
						ОбластьДетальныхЗаписей.Области.Стоимость2.ЦветФона = Цвет2;
					КонецЕсли;
				Иначе //соответствуют - зеленые
					//ОбластьДетальныхЗаписей.Области.Стоимость1.ЦветФона = Цвет1;
					//ОбластьДетальныхЗаписей.Области.Стоимость2.ЦветФона = Цвет1;
					ОбластьДетальныхЗаписей.Области.Стоимость1.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
					ОбластьДетальныхЗаписей.Области.Стоимость2.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	// Зафиксируем заголовок отчета
	ТабДок.ФиксацияСверху 	= 6;
	ТабДок.ПолеСлева 		= 0;
	ТабДок.ПолеСправа 		= 0;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ  

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = ДатаНач;
	ДиалогПериода.Период.ДатаОкончания = ДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Не Период = Неопределено Тогда
		ДатаНач = Период.ДатаНачала;
		ДатаКон = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Если НЕ ЗначениеЗаполнено(Сортировка) Тогда
		ПоказатьПредупреждение(, "Не указан вариант сортировки!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ПоказатьПредупреждение(, "Не выбрана организация!");
		Возврат;
	КонецЕсли;
	
	// проверка даты начала и окончания периода
	Если ЭтаФорма.ДатаНач > ЭтаФорма.ДатаКон Тогда
		ТекстСообщения = НСтр("ru = 'Дата начала периода не может быть больше даты конца периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	          
	СформироватьОтчетСервер();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаКон = НачалоМесяца(ТекущаяДата())-1;
	ДатаНач = НачалоМесяца(ДатаКон);
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Сортировка) Тогда
		Сортировка = "По ТС";
	КонецЕсли;
	ТСВыбыло = Ложь;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

Цвет1 = Новый Цвет(220, 255, 220); //зеленый
Цвет2 = Новый Цвет(255, 235, 220); //красный
